In [1]:
import pandas as pd

In [12]:
pd.read_csv('secFile.csv',delimiter='|',index_col=)

           eno,ename,age
1  Amar               24
2  Akash              20
3  Rohan              20
4  Rajiv              24
5  Akash              30
6  Sonali             42
7  Rohan              26
8  Rohan              20
9  Ankita             15
10 Ritik              20